<?php

namespace App\Rules;

use Closure;
use Illuminate\Contracts\Validation\ValidationRule;

class PhoneValidationRule implements ValidationRule
{
    public function validate(string $attribute, mixed $value, Closure $fail): void
    {
        // Убираем все не цифры
        $cleanPhone = preg_replace('/\D/', '', $value);

        // Проверяем российский номер
        if (!preg_match('/^[78]\d{10}$/', $cleanPhone)) {
            $fail('Номер телефона должен быть в формате российского номера');
            return;
        }

        // Проверяем на корректность кода оператора
        $operatorCode = substr($cleanPhone, 1, 3);
        $validCodes = [
            '900', '901', '902', '903', '904', '905', '906', '908', '909',
            '910', '911', '912', '913', '914', '915', '916', '917', '918', '919',
            '920', '921', '922', '923', '924', '925', '926', '927', '928', '929',
            '930', '931', '932', '933', '934', '936', '937', '938', '939',
            '941', '942', '949',
            '950', '951', '952', '953', '954', '955', '956', '958', '959',
            '960', '961', '962', '963', '964', '965', '966', '967', '968', '969',
            '970', '971', '977', '978', '979',
            '980', '981', '982', '983', '984', '985', '986', '987', '988', '989',
            '990', '991', '992', '993', '994', '995', '996', '997', '999',
        ];

        if (!in_array($operatorCode, $validCodes)) {
            $fail('Некорректный код оператора в номере телефона');
        }

        $notValidNumbers = [
            '9000000000', '9111111111', '9222222222',
            '9333333333', '9444444444', '9555555555',
            '9666666666', '9777777777', '9888888888',
            '9999999999', '1234567890', '0123456789',
        ];
        $phoneNumber = substr($cleanPhone, 1);

        if (in_array($phoneNumber, $notValidNumbers)) {
            $fail('Некорректный номер телефона');
        }
    }
}
